"%@ - Offline" = "%@ – neprisijungęs";

"3D Secure" = "3D saugi";

"Add New Card…" = "Pridėti naują kortelę...";

"Add a Card" = "Pridėti kortelę";

"Apt." = "But.";

"Contact" = "Susisiekti";

"Delivery" = "Pristatymas";

"Delivery Address" = "Pristatymo adresas";

"Free" = "Nemokamai";

"Invalid Shipping Address" = "Netinkamas siuntimo adresas";

"Loading…" = "Įkeliama...";

"Multibanco" = "„Multibanco“";

"Next" = "Toliau";

"Online Banking (FPX)" = "Interneto banko paslaugos (FPX)";

"Payment Method" = "Mokėjimo būdas";

"Shipping" = "Siuntimas";

"Shipping Method" = "Siuntimo būdas";

"Use Billing" = "Naudoti sąskaitų siuntimo adresą";

"Use Delivery" = "Naudoti pristatymo adresą";

"Use Shipping" = "Naudoti siuntimo adresą";
